In [8]:
import pandas as pd
import numpy as np

In [11]:
df = pd.read_csv('C:\\Users\\drbhi\\venv\\CSCN8000_classic_ml\\Salary.csv')
df

  Name of the Person  Earning
0               Sean    30000
1               Carl    15000
2               John    20000
3              Ranny    15250
4              Dansh    17500
5               Tony    15500
6              James    10000
7               Lisa    15000
8              Leila  1500000

In [13]:
df.Earning.describe()

count    9.000000e+00
mean     1.820278e+05
std      4.942699e+05
min      1.000000e+04
25%      1.500000e+04
50%      1.550000e+04
75%      2.000000e+04
max      1.500000e+06
Name: Earning, dtype: float64

In [14]:
df.Earning.quantile(0)

10000.0

In [15]:
df.Earning.quantile(0.25,interpolation="higher")

15000

In [16]:
df.Earning.quantile(0.5,interpolation="higher")

15500

In [17]:
df.Earning.quantile(0.75)

20000.0

In [18]:
df.Earning.quantile(1)

1500000.0

In [19]:
z = df.Earning.quantile(0.99)
z

1382400.0

In [20]:
df[df.Earning>z]

  Name of the Person  Earning
8              Leila  1500000

In [21]:
df

  Name of the Person  Earning
0               Sean    30000
1               Carl    15000
2               John    20000
3              Ranny    15250
4              Dansh    17500
5               Tony    15500
6              James    10000
7               Lisa    15000
8              Leila  1500000

In [23]:
df['Earning'][4]=np.NaN

C:\Users\drbhi\AppData\Local\Temp\ipykernel_13568\1047682229.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Earning'][4]=np.NaN

In [24]:
df

  Name of the Person    Earning
0               Sean    30000.0
1               Carl    15000.0
2               John    20000.0
3              Ranny    15250.0
4              Dansh        NaN
5               Tony    15500.0
6              James    10000.0
7               Lisa    15000.0
8              Leila  1500000.0

In [25]:
df.Earning.mean()

202593.75

In [26]:
df_new = df.fillna(df.Earning.mean())
df_new

  Name of the Person     Earning
0               Sean    30000.00
1               Carl    15000.00
2               John    20000.00
3              Ranny    15250.00
4              Dansh   202593.75
5               Tony    15500.00
6              James    10000.00
7               Lisa    15000.00
8              Leila  1500000.00

In [27]:
df_new = df.fillna(df.Earning.median())
df_new

  Name of the Person    Earning
0               Sean    30000.0
1               Carl    15000.0
2               John    20000.0
3              Ranny    15250.0
4              Dansh    15375.0
5               Tony    15500.0
6              James    10000.0
7               Lisa    15000.0
8              Leila  1500000.0